{
    "title":"Breaking the <script>",
    "description":"Since its inception in 1995, JavaScript has been growing into the most popular, dominant language of the web. Over the last decade, the adoption of JS has only been growing, showing no signs of slowing down. According to StackOverflow’s annual survey, 69.8% of respondents and 71.5% of professional developers are using JavaScript today. With the prevalence of more web-enabled devices, the race to come up with the best ‘one size fits all solution’ grows bigger. This is great news for developers who either know JS or are planning to learn it. For those that are far from the front end world, suggestions are for them to try and gain (even basic) experience with it. This quote sums it up perfectly:\n❝This [JavaScript] is perhaps the hottest skill developers need to up-skill in for the foreseeable future❞\n\nThis will be a free short course for the absolute beginners of JavaScript containing 4 different live sessions. Students with a basic knowledge over HTML will be enough to join the sessions. The whole course will be conducted online and every participant completing all the 4 sessions will get a digital certificate. There will also be a quick contest after the sessions and the best learner will be awarded.\n\nRegister now: https://forms.gle/t17RPzfjcZqDgyH76\nN.B.: Only for the students of Notre Dame College, Dhaka, Batch-21.\n\nThe sessions will be as followed-\n    Session 0: Basics of Web Development, Everything about the browser console, Getting Started with JavaScript\n● Session 1: Introduction to the <script> tag, JavaScript and its applications, JS Basics ( Variables, Loops, Conditions, Functions, Array, Objects, Date), Events ( onClick, onKey, onMouseMove, onLoad, onunLoad, onChange, onError, onFocus, onSelect, Form Event Handler )\n● Session 2: Introduction to VanillaJS, Selectors, Event Listeners, Functions, Creating HTML element using JS, JS Window Object ( window.open(), window.close(), window.print(), window.find() )\n● Session 3: Example project (Making a Todo list using JS), Conclusion\n\nFor any queries, please contact us through our Facebook page: https://www.facebook.com/nditc.official or mail us at: info@nditc.org or post any questions at our forum (https://community.nditc.org/thread-category/forum/)\n\nChowdhury Isfatul Karim\nPresident (Programming)\n+8801829369933\n\nFahim Murshed Rabby\nPresident (Administration)\n+8801731767903\n\nHrithik Deb\nPresident (Archive, Workshop and Seminars)\n+8801776433543",
    "launching_date":"",
    "images":[
      {
        "title":"",
        "url":"https://nditc.org/assets/images/breaking%20the%20script-01.png"
      }
    ]
}
